app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(school_classes_params)
    if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Blurgenheim"], ["room_number", 999], ["created_at", "2021-01-16 21:37:51.953567"], ["updated_at", "2021-01-16 21:37:51.953567"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_classes_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 1000], ["updated_at", "2021-01-16 22:44:28.542113"], ["id", 8]]